{
  "India": "India is a country in South Asia with a civilization history spanning millennia, rich in cultural, linguistic and geographic diversity.",
  "Andhra Pradesh": "Andhra Pradesh has a long historical tradition with ancient Buddhist sites and the Vijayanagara influence in the south.",
  "Arunachal Pradesh": "Arunachal Pradesh is home to diverse tribal cultures and archaeological sites in the eastern Himalayas.",
  "Assam": "Assam is known for its tea gardens, Ahom kingdom history, and the Brahmaputra river civilization.",
  "Bihar": "Bihar includes ancient seats of learning such as Nalanda and Bodh Gaya and was central to early Indian empires.",
  "Chhattisgarh": "Chhattisgarh carries a tribal cultural heritage and historic temples dating back to medieval times.",
  "Goa": "Goa was a Portuguese colony for centuries and is known for its colonial architecture and coastal trade history.",
  "Gujarat": "Gujarat has been an ancient maritime and trading hub, home of the Indus Valley sites like Lothal and later merchant ports.",
  "Haryana": "Haryana contains sites tied to the Mahabharata (Kurukshetra) and later Mughal and colonial histories.",
  "Himachal Pradesh": "Himachal Pradesh consists of Himalayan kingdoms and hill-state cultures with ancient temples and forts.",
  "Jharkhand": "Jharkhand holds prehistoric rock art sites and a long history of tribal resistance and mineral-based economy.",
  "Karnataka": "Karnataka was home to powerful dynasties like the Chalukyas, Hoysalas, and Vijayanagara Empire with rich temple architecture.",
  "Kerala": "Kerala's history includes ancient spice trade contacts with Romans and Arabs, and unique cultural traditions like Kathakali.",
  "Madhya Pradesh": "Madhya Pradesh hosts major historic sites such as Khajuraho temples and was central to medieval empires.",
  "Maharashtra": "Maharashtra is known for the Maratha Empire under Shivaji, medieval forts, and important trade cities like Mumbai.",
  "Manipur": "Manipur has a distinct cultural and royal history in northeastern India, with traditional dance and martial practices.",
  "Meghalaya": "Meghalaya's indigenous Khasi and Garo cultures and natural landscapes mark its historical identity.",
  "Mizoram": "Mizoram's tribal communities and migration histories define its regional past in the northeast.",
  "Nagaland": "Nagaland has diverse Naga tribes with their own histories and oral traditions, and played roles during colonial times.",
  "Odisha": "Odisha is famous for ancient temples (Konark, Puri) and the Kalinga region's significant role in Mauryan history.",
  "Punjab": "Punjab's history includes the Sikh Gurus, the Maurya and Mughal periods, and critical events during partition.",
  "Rajasthan": "Rajasthan's history is dominated by Rajput kingdoms, forts, and rich medieval warrior culture.",
  "Sikkim": "Sikkim's history includes a Himalayan monarchy and later integration into India in 1975.",
  "Tamil Nadu": "Tamil Nadu has an ancient Dravidian civilization with Sangam literature, Chola and Pallava empires, and temple traditions.",
  "Telangana": "Telangana's history includes the Kakatiya dynasty and later Hyderabad State's Nizam era influences.",
  "Tripura": "Tripura has a long royal lineage and tribal cultures in the northeast with links to ancient kingdoms.",
  "Uttar Pradesh": "Uttar Pradesh hosts ancient cities like Varanasi and major medieval capitals, central to India's religious history.",
  "Uttarakhand": "Uttarakhand includes Himalayan pilgrimage sites such as Haridwar and Badrinath with ancient spiritual traditions.",
  "West Bengal": "West Bengal's history includes ancient Bengal kingdoms, colonial Calcutta, and rich literary-cultural movements.",
  "Andaman and Nicobar Islands": "Andaman & Nicobar Islands have histories of indigenous tribes and later colonial penal settlements.",
  "Chandigarh": "Chandigarh is a planned city and union territory designed by Le Corbusier in the 20th century.",
  "Dadra and Nagar Haveli and Daman and Diu": "This union territory has colonial histories with Portuguese influence in pockets like Daman and Diu.",
  "Lakshadweep": "Lakshadweep's islands have maritime South Indian and Arab trade connections and unique island cultures.",
  "Delhi": "Delhi has been the seat of many empires over centuries, from Delhi Sultanate to Mughal and British eras.",
  "Jammu and Kashmir": "Jammu & Kashmir's history spans ancient kingdoms, Buddhist influences, and modern political complexities.",
  "Ladakh": "Ladakh's history is shaped by Tibetan Buddhism, Himalayan trade routes, and mountain kingdom cultures.",
  "Puducherry": "Puducherry (Pondicherry) was a French colonial enclave with distinctive colonial architecture and cultural fusion."
}